[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Data Science Applications",
    "description": {},
    "author": [],
    "date": "2021-10-05",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-05T18:29:24-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-29-the-monty-hall/",
    "title": "The Monty Hall",
    "description": "Are you ready to put your luck to the test to try and win a new car?  As we explore the once great game, \"Let Make a Deal\", back from 1975, you will have the chance to see if you can crack the puzzle and win the prize.",
    "author": [],
    "date": "2021-09-29",
    "categories": [],
    "contents": "\n\n\nThe Game\nThe American TV show, “Let’s Make A Deal”, started in 1963 and was a global hit. The premise of the game was that a contestant would be offered a prize and then given a choice whether they would like to keep it, or exchange it for a different prize. The challenge is that the other prize is hidden from the player. So in the act of exchanging, the player doesn’t know if they are getting a new prize of better or worse value.\nOn the show, there was a particular game that was played that has since then become famous and has been named the Monty Hall Problem. In this game, the contestant would be shown three doors, behind one of them, a glorious prize, behind the other two, goats. Through a serious of steps, the contestant would try and guess which door has the prize.\nBefore I share some statistical knowledge to them game, lets run through it as if we were contestants. Instead of playing behind three doors, we will play with playing cards that either have a goat or a queen. As in the image below, there are there are two possible outcomes, a goat or a queen.\n\nFace Down\n\n\n\n\nFace Up\n\n\n\nLet’s Play a Round\nWhat would happen first, is Monty (the Host of the game show), would ask you to pick any door. You would then pick any of the three cards. Note, we are not going to flip over this card, instead we will save it till the end. Now, let’s say you pick the left door to save because you think it has the Queen behind it.\n\n\nAfter picking which door to save, Monty would then show you a goat behind one of the other two doors. Since two of the cards have goats on the other side, there will always be at least one card to flip over that has the goat.\n\n\nAt this point, you know that the Queen is either behind the card you chose at the beginning or behind the card still face down. Monty will then ask you, would you like to keep your card, or switch to the other one. Which ever card you pick will be the card you end the game with, resulting in either a grand prize, or a goat.\nIn this example, you decide to test your luck and stay with the card you picked at the beginning. Monty then flips over the cards to show that your card had the other goat. Sadly, you lost the game and didn’t get the prize.\n\n\nThe concept of this game seems quite straightforward - pick a card and hope that you picked right. But, there is little more than just luck at play in this game. As this game was played more and more times, statisticans found that this game relid greatly upon the fundatmentals of probability.\nIn the next section, I will elaborate on how probabilty might hold the key to understand this game as well as winning the prize.\nThe Probability Explained\nTo begin, let start off by understanding some simple probability facts. First, all the probabilities in a given event must add up to 1. The probabilities of each event may change or moved around but at the end, must always add up to 1.\nNow let’s begin; we know that behind two of the cards there are goats and behind the other is the queen. So, if we were to assign probabilities of being the queen to each card, each would have a 1/3 chance. At this point, trying to guess which card would be the queen would be a gamble.\n\n\nNext, Monty is going to flip over one of the cards to show us a goat. However, we now have an issue with our probabilities, they no longer add up to 1! Does that mean each card now has a fifty-fifty of being the queen?\nWhat happens now is what makes this game so interesting. When we chose that first card, it had a probability of 1/3. This probability will not change, but rather, the probability of other card. In order to correct our probability issue, we will have to give it a new probability.\n\n\nTo figure this out, lets write out what we know. We know that our card has a 1/3 probability of having the queen. So to find the probability of the new card, we will subtract 1/3 to 1. This will give us the probability that the ‘Other Card’ is the queen.\n\\[\n\\text{------------------------------------------------}\n\\\\\\text{Prob(Queen| Our Card) = 1/3}\\\\\\text{Prob(Queen| Other Card) = 1 - Prob(Queen| Our Card) = 2/3}\\\\\\text{------------------------------------------------}\n\\]\n\n\nThis means that my switching cards, we go from a 33% chance of having the Queen, to a 66% chance.\nConclusion\nNow wasn’t that fun! From this game, we were able to discover the probability secret to raising our chances of Winning the Prize! To recap what we discovered, when playing this game, when asked if you want to switch your card at the end, SAY YES!\n\n\n\n",
    "preview": "posts/2021-09-29-the-monty-hall/../../images/Logo.png",
    "last_modified": "2021-10-07T16:07:00-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-29-the-two-child-problem/",
    "title": "The Twin Problem",
    "description": "When given the chance to guess the gender of a child, is it\nas easy at fifty-fifty, or is there some deeper probability at hand?  In this problem, we explore the probability of guessing the gender of a twin when we are told the gender of one.",
    "author": [],
    "date": "2021-09-29",
    "categories": [],
    "contents": "\n\n\nBackground\nIt is a beautiful afternoon and you are on your normal walk around the park. After some time of walking, you decide to sit down and catch a breather. While on a bench, you start up a conversation with a very nice lady who says she has come to the park with her two twin children. During the conversation a little boy comes over and calls the lady, “Mom”. As the little boy is talking to his mother, you begin to wonder if the other twin child is also a boy or a girl. After a few moments of thought, you realize that this question has more to do with probability that with biology. What is the probability that the other child is a girl or boy?\nProbability Explained\nMost people know that there is a fifty-fifty chance of getting tails when flipping coin. This can be written out as:\n\\[\n\\text{------------------------------------------------}\n\\\\\\text{Prob(tails) = 1/2} \\\\\\text{------------------------------------------------}\n\\]\nAnd thanks to our knowledge of biology, this same statement applies. The probability of have a boy or girl is 50%. So why then isn’t the answer to the ‘Twin Problem’ just 50% girl and 50% boy? It is because of possible combinations, which we will go over now.\nIf we were to draw out all the combinations of twins, it would look something like the image below.\n\n\nIn total, there are four possible combinations as drawn out in the image. In each combination, there is a specific order that is important to note. We will not use this plot to solve the question.\nAnalysis\nIn the story, you find out that one of the woman’s twins is a boy. This will help us eliminate the possible outcome where both children are girls (image below). The red circle is to demonstrate that we know at least one of the children is a boy for each possible combination.\n\n\nNow, something important to note is that we were not told whether the boy was born first. Because of that, we have to keep both combinations 3 and 4 even though they contain the same pieces in their combos.\nThe next step will be to start adding some probability to each option. In the figure below, the remaining combinations are shown with their probability above. In each option, a male is covered with blue, telling us that we already know there is a male twin.\n\n\nAs we see from the illustration above, of the combinations we have left, there is a 1/3 chance of each combination occuring. At this point, we will combine probabilities of those with the same outcome.\n\n\nWith the aid of this last visual, we can see that there is a probability of 33% that the other twin is a boy and a 66% that the other twin is a girl.\nConclusion\nAfter a moment of thinking, you turn to the lady on the bench and ask, “I am just guessing here, but is your other child a girl?” The lady responses with mild surprise, “Yes, have we meet before?” You reply, “no”, and tell her it was just a good guess.\n\n\n\n",
    "preview": "posts/2021-09-29-the-two-child-problem/../../images/profile_twin_pic.png",
    "last_modified": "2021-10-12T10:58:33-06:00",
    "input_file": "the-two-child-problem.knit.md"
  },
  {
    "path": "posts/2021-09-29-the-birthday-paradox/",
    "title": "The Birthday Paradox",
    "description": "Are birthday's all that random or is there a great chance that someone in the same room as you right now has the same birthday?  As we unravel this paradox, you will be suprised to find that chance of sharing the same special day, really isn't that surprising.",
    "author": [],
    "date": "2018-09-29",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": "posts/2021-09-29-the-birthday-paradox/../../images/cake_pic.png",
    "last_modified": "2021-10-06T16:57:58-06:00",
    "input_file": {}
  }
]
